In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({"A":[1,2,3], "B":[10,20,30]})

In [3]:
df2 = pd.DataFrame({"C":[4,5,6], "D":[40,50,60]})

In [4]:
display(df1,df2)

   A   B
0  1  10
1  2  20
2  3  30

   C   D
0  4  40
1  5  50
2  6  60

In [5]:
df1.join(df2)

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [6]:
df2.join(df1)

   C   D  A   B
0  4  40  1  10
1  5  50  2  20
2  6  60  3  30

In [11]:
df3 = pd.DataFrame({"A":[1,2,3], "B":[10,20,30]}, index=["A","B","C"])

In [12]:
df4 = pd.DataFrame({"C":[4,5], "D":[40,50]}, index=["A","B"])

In [13]:
df3.join(df4)

   A   B    C     D
A  1  10  4.0  40.0
B  2  20  5.0  50.0
C  3  30  NaN   NaN

In [19]:
df3.join(df4, how="left")

   A   B    C     D
A  1  10  4.0  40.0
B  2  20  5.0  50.0
C  3  30  NaN   NaN

In [20]:
df3.join(df4, how="right")

   A   B  C   D
A  1  10  4  40
B  2  20  5  50

In [21]:
df3.join(df4, how="inner")

   A   B  C   D
A  1  10  4  40
B  2  20  5  50

In [22]:
df3.join(df4, how="outer")

   A   B    C     D
A  1  10  4.0  40.0
B  2  20  5.0  50.0
C  3  30  NaN   NaN